We are encountering a similar issue with the `aws_region` data resource.

We're on version `v3.76.1` of the AWS provider, and have tested this on both `v1.0.11` and `v1.3.9` of Terraform.

We have two modules that are used together for making a lambda function. I've simplified the examples to keep this concise.

```hcl
# main.tf
module "iam_role" {

}

module "lambda_function" {

  iam_role = module.iam_role.arn
}
```

Inside the lambda_function module, we look up the aws_region and join it with a few user values to create the function name.

```hcl
# lambda_function module
data "aws_region" "current" {}

resource "random_id" "main" {
  byte_length = 2
}

resource "aws_lambda_function" "main" {
  function_name = join("-", [var.input_1, data.aws_region.current.name, var.input_2, random_id.main.hex,])
}
```

The problem we're encountering is when an inconsequential input to the iam_role module is changed, it's triggering the data resource inside the lambda module to re-read, and then recreate the function (with the same name after the apply completes). We also use a random string in the name, and that resource does NOT get changed.

For instance, if we simply add a new tag to the iam_role, the data resource will get marked as needing to be read during apply due to a dependency.

```
# terraform plan output
  # module.lambda_function.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.lambda_function.aws_lambda_function.main must be replaced
  -/+ resource "aws_lambda_function" "main" {
        # redacted additional changes
      ~ function_name                  = "redacted" -> (known after apply) # forces replacement
  }

  # module.iam_role.aws_iam_role.main will be updated in-place
  ~ resource "aws_iam_role" "main" {
        id                    = "redacted"
        name                  = "redacted"
      ~ tags                  = {
          + "DummyTag"   = "anyvalue"
            # (7 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "DummyTag"   = "anyvalue"
            # (7 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
```